package com.daxue;

/**
 * @author daxue0929
 * @date 2021/06/26
 **/

public class StringUtils {
    public static void main(String[] args){
        String aa = "广州珠江实业集团有限公司,珠江实业集团,二级公司,合作公司,广州珠江实业开发股份有限公司,广州城市更新集团有限公司,广州珠实城市更新发展有限公司,广州珠江产业园投资发展有限公司,广州珠江商业经营管理有限公司,广州珠江住房租赁发展投资有限公司,广州捷星房地产开发有限公司,广州市城实投资有限公司,广州珠江外资建筑设计院有限公司,广州珠江工程建设监理有限公司,广州珠江装修工程有限公司,广州珠江建设发展有限公司,广州珠江城市管理服务集团股份有限公司,广州珠江体育文化发展股份有限公司,广州珠实投资基金管理有限公司,广州珠江健康资源管理集团有限公司,广州市建设工程拆迁有限公司,瑞士中星投资有限公司,陕西珠江房地产开发有限公司,广州珠江投资发展有限公司,广州珠江物业管理有限公司,湖南珠江实业投资有限公司,广东嘉德丰投资发展有限公司,股份全资子公司,股份控股子公司,股份合作子公司,广州市广隆房地产有限公司,广州珠江实业健康管理有限公司,安徽中侨置业投资有限公司,广东金海投资有限公司,广州天晨房地产开发有限公司,广州珠江物业管理有限公司长沙分公司,海南珠江绿岛投资有限公司,清远市中怡物业发展有限公司,湖南新地置业发展有限公司,广州智联汽车小镇投资发展有限公司,广州环东城市开发运营有限公司,广州市盛唐房地产开发有限公司,广州璟逸房地产开发有限公司,广州珠江实业环境保护有限公司,广州南实投资有限公司,广州市品实房地产开发有限公司,梅州珠实投资有限公司,广州市城德房地产开发有限公司,清远市广州后花园有限公司,广州珠实通投资发展有限公司,广州斯博瑞酒店有限公司,广东世外高人健康产业发展有限公司,广州珠江实业绿洲房地产发展有限公司,广州富旭教育咨询有限公司,韶关市瑞枫投资有限公司,测试单位,广州美林湖实业投资有限公司,清远市珠水美悦酒店管理有限公司,清远市后花园物业管理有限公司,广州璟润房地产开发有限公司,广州市江汇物业经营管理有限公司,广州珠江家园健康养老服务有限公司,广州市江沛物业发展有限公司";
        String[] split = aa.split(",");
        System.out.println(split.length);
    }
}
